app/Controllers/Lokasi.php

SELECT *
FROM `produk`
WHERE `lokasii` = 'Cilacap'
---
    public function index($area = 'Cilacap')
    {
        $produkModel = new ProdukModel();

        $data['produk'] = $produkModel->where('lokasii', $area)->findAll();